# My-home-work
in this repository i will doing my home work
#include <iostream>
#include <cmath>

using namespace std;

// Функция для расчета корней, и вывода информации на экран
void rootCalculate(double a , double b , double c){
    //Задаем необходимые переменные для расчета
     float x1 , x2 , d ;
    //  Вычисляем дискриминант, и корни
     d = b*b - (4*a*c);
     x1 = (-b+sqrt(d))/2*a ;
     x2 = (-b-sqrt(d))/2*a ;
     /* Если дискрименант больше, то выводим
        Если дискрименант равен ноль, то корни одинаковы
        Если дискрименант отрицателен, то корни мнимые
     */
     if(d>0)
        cout<< "Удалось расчитать корни\n"<< "x1 =" << x1 << "\nx2 = " << x2 ;
     else{
          if(d==0)
             cout<<"Удалось расчитать корни!\n"<< "Они одинаковы и равны:  " << x1 ;
          else
        cout<<"Корни мнимые!\n" ;
     }
 }

int main()
{
    float a , b , c  ;
    // Изменяем кодировку вывода
    setlocale(LC_ALL, "Russian");
    cout << "Добро пожаловать!\n"  << "Данная программа предназначена для высчитывания корней квадратных уровнений" << "\n";
    cout << "Введите первый коэффициент: " ;
    cin >> a ;
    cout << "Введите второй коэффициент: ";
    cin >> b ;
    cout << "Введите третий коэффициент: ";
    cin >> c ;
    // Используем нашуфункцию ...
    rootCalculate(a,b,c);

    return 0;
}
